[NoCoverage] BlockStatement
questions/handlers/random/index.get.handler.ts:9:79
 import { createQuestionFromQuestionDto } from "#server/utils/goat-it-api/mappers/question/question.mappers";
 import { createGoatItApiEndpoint, createGoatItApiFetchOptions, handleGoatItApiError } from "#server/utils/goat-it-api/helpers/goat-it-api.helpers";
 
-async function getRandomQuestionsHandler(event: H3Event): Promise<Question[]> {
-  const config = useRuntimeConfig(event);
-  const endpoint = createGoatItApiEndpoint("questions", { suffix: "random" });
-  const fetchOptions = createGoatItApiFetchOptions(config.goatItApi);
-
-  try {
-    const rawData = await $fetch(endpoint, fetchOptions);
-    const questions = z.array(QUESTION_DTO).parse(rawData);
-
-    return questions.map(createQuestionFromQuestionDto);
-  } catch(error: unknown) {
-    handleGoatItApiError(error);
-  }
-}
+async function getRandomQuestionsHandler(event: H3Event): Promise<Question[]> {}
 
 export {

[NoCoverage] StringLiteral
questions/handlers/random/index.get.handler.ts:11:44
 
 async function getRandomQuestionsHandler(event: H3Event): Promise<Question[]> {
   const config = useRuntimeConfig(event);
-  const endpoint = createGoatItApiEndpoint("questions", { suffix: "random" });
+  const endpoint = createGoatItApiEndpoint("", { suffix: "random" });
   const fetchOptions = createGoatItApiFetchOptions(config.goatItApi);
 

[NoCoverage] BlockStatement
questions/handlers/random/index.get.handler.ts:14:7
   const endpoint = createGoatItApiEndpoint("questions", { suffix: "random" });
   const fetchOptions = createGoatItApiFetchOptions(config.goatItApi);
 
-  try {
-    const rawData = await $fetch(endpoint, fetchOptions);
-    const questions = z.array(QUESTION_DTO).parse(rawData);
-
-    return questions.map(createQuestionFromQuestionDto);
-  } catch(error: unknown) {
+  try {} catch(error: unknown) {
     handleGoatItApiError(error);
   }

[NoCoverage] BlockStatement
questions/handlers/random/index.get.handler.ts:19:27
     const questions = z.array(QUESTION_DTO).parse(rawData);
 
     return questions.map(createQuestionFromQuestionDto);
-  } catch(error: unknown) {
-    handleGoatItApiError(error);
-  }
+  } catch(error: unknown) {}
 }
 
