[Killed] BlockStatement
utils/goat-it-api/mappers/goat-it-api.mappers.ts:5:101
 
 import type { QuestionTheme } from "#shared/types/question-theme.types";
 
-function createQuestionThemeFromQuestionThemeDto(questionThemeDto: QuestionThemeDto): QuestionTheme {
-  return {
-    id: questionThemeDto.id,
-    slug: questionThemeDto.slug,
-    color: questionThemeDto.color,
-    label: questionThemeDto.label,
-    aliases: questionThemeDto.aliases,
-    description: questionThemeDto.description,
-    status: questionThemeDto.status,
-    createdAt: new Date(questionThemeDto.createdAt),
-    updatedAt: new Date(questionThemeDto.updatedAt),
-  };
-}
+function createQuestionThemeFromQuestionThemeDto(questionThemeDto: QuestionThemeDto): QuestionTheme {}
 
 export {
killedBy: Question Mappers createQuestionFromQuestionDto should create question from question dto with correct properties when called.
statusReason: expected { …(11) } to strictly equal { …(11) }
