[Killed] BlockStatement
goat-it-api/mappers/question/question.mappers.ts:6:68
 import type { Question } from "#shared/types/question.types";
 import { createQuestionThemeFromQuestionThemeDto } from "#server/utils/goat-it-api/mappers/goat-it-api.mappers";
 
-function createQuestionFromQuestionDto(dto: QuestionDto): Question {
-  return {
-    id: dto.id,
-    category: dto.category,
-    themes: dto.themes.map(themeAssignment => ({
-      theme: createQuestionThemeFromQuestionThemeDto(themeAssignment.theme),
-      isPrimary: themeAssignment.isPrimary,
-      isHint: themeAssignment.isHint,
-    })),
-    content: dto.content,
-    cognitiveDifficulty: dto.cognitiveDifficulty,
-    author: dto.author,
-    status: dto.status,
-    rejection: dto.rejection,
-    sourceUrls: dto.sourceUrls,
-    createdAt: new Date(dto.createdAt),
-    updatedAt: new Date(dto.updatedAt),
-  };
-}
+function createQuestionFromQuestionDto(dto: QuestionDto): Question {}
 
 export {
killedBy: Question Mappers createQuestionFromQuestionDto should create question from question dto with correct properties when called.
statusReason: expected undefined to strictly equal { …(11) }

[Killed] ArrowFunction
goat-it-api/mappers/question/question.mappers.ts:10:28
   return {
     id: dto.id,
     category: dto.category,
-    themes: dto.themes.map(themeAssignment => ({
-      theme: createQuestionThemeFromQuestionThemeDto(themeAssignment.theme),
-      isPrimary: themeAssignment.isPrimary,
-      isHint: themeAssignment.isHint,
-    })),
+    themes: dto.themes.map(() => undefined),
     content: dto.content,
     cognitiveDifficulty: dto.cognitiveDifficulty,
killedBy: Question Mappers createQuestionFromQuestionDto should create question from question dto with correct properties when called.
statusReason: expected { …(11) } to strictly equal { …(11) }
