[Survived] BlockStatement
question-themes/handlers/get-all/index.get.handler.ts:10:83
 import { createGoatItApiEndpoint, createGoatItApiFetchOptions, handleGoatItApiError } from "#server/utils/goat-it-api/helpers/goat-it-api.helpers";
 import { FIND_QUERY_UNBOUNDED_LIMIT } from "#server/utils/goat-it-api/goat-it-api.constants";
 
-async function getQuestionThemesHandler(event: H3Event): Promise<QuestionTheme[]> {
-  const config = useRuntimeConfig(event);
-  const endpoint = createGoatItApiEndpoint("question-themes");
-  const fetchOptions = createGoatItApiFetchOptions(config.goatItApi);
-  const rawQuery = getQuery(event);
-  const query = FIND_QUESTION_THEMES_QUERY_DTO.loose().parse({
-    ...rawQuery,
-    limit: FIND_QUERY_UNBOUNDED_LIMIT,
-  });
-
-  try {
-    const rawData = await $fetch(endpoint, { ...fetchOptions, query });
-    const questionThemes = z.array(QUESTION_THEME_DTO).parse(rawData);
-
-    return questionThemes.map(createQuestionThemeFromQuestionThemeDto);
-  } catch(error: unknown) {
-    handleGoatItApiError(error);
-  }
-}
+async function getQuestionThemesHandler(event: H3Event): Promise<QuestionTheme[]> {}
 
 export {

[Killed] BlockStatement
question-themes/handlers/get-all/index.get.handler.ts:20:7
     limit: FIND_QUERY_UNBOUNDED_LIMIT,
   });
 
-  try {
-    const rawData = await $fetch(endpoint, { ...fetchOptions, query });
-    const questionThemes = z.array(QUESTION_THEME_DTO).parse(rawData);
-
-    return questionThemes.map(createQuestionThemeFromQuestionThemeDto);
-  } catch(error: unknown) {
+  try {} catch(error: unknown) {
     handleGoatItApiError(error);
   }
killedBy: Server Goat It API Question Themes Get Handler getQuestionThemesHandler should fetch question themes from goat it api with correct endpoint, fetch options and query when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ '/question-themes', { …(3) } ]

Number of calls: 0

[Killed] ObjectLiteral
question-themes/handlers/get-all/index.get.handler.ts:21:44
   });
 
   try {
-    const rawData = await $fetch(endpoint, { ...fetchOptions, query });
+    const rawData = await $fetch(endpoint, {});
     const questionThemes = z.array(QUESTION_THEME_DTO).parse(rawData);
 
killedBy: Server Goat It API Question Themes Get Handler getQuestionThemesHandler should fetch question themes from goat it api with correct endpoint, fetch options and query when called.
statusReason: expected "vi.fn()" to be called once with arguments: [ '/question-themes', { …(3) } ]

Received:

  1st vi.fn() call:

  [
    "/question-themes",

[Killed] BlockStatement
question-themes/handlers/get-all/index.get.handler.ts:25:27
     const questionThemes = z.array(QUESTION_THEME_DTO).parse(rawData);
 
     return questionThemes.map(createQuestionThemeFromQuestionThemeDto);
-  } catch(error: unknown) {
-    handleGoatItApiError(error);
-  }
+  } catch(error: unknown) {}
 }
 
killedBy: Server Goat It API Question Themes Get Handler getQuestionThemesHandler should call handleGoatItApiError when $fetch throws an error.
statusReason: expected "vi.fn()" to be called once with arguments: [ Error: Network error ]

Number of calls: 0
