[Killed] BlockStatement
utils/goat-it-api/helpers/goat-it-api.helpers.ts:15:121
   suffix?: string;
 };
 
-function createGoatItApiEndpoint(resourceName: GoatItApiResourceName, options?: CreateGoatItApiEndpointOptions): string {
-  const segments = [GOAT_IT_API_GAME_SCOPE_NAME, resourceName].filter(isNonEmptyString);
-  let endpoint = `/${segments.join("/")}`;
-
-  if (isNonEmptyString(options?.id)) {
-    endpoint += `/${options.id}`;
-  } else if (isNonEmptyString(options?.suffix)) {
-    endpoint += `/${options.suffix}`;
-  }
-  return endpoint;
-}
+function createGoatItApiEndpoint(resourceName: GoatItApiResourceName, options?: CreateGoatItApiEndpointOptions): string {}
 
 function createGoatItApiFetchOptions(goatItApiRuntimeConfig: SharedRuntimeConfig["goatItApi"]): Parameters<typeof $fetch>[1] {
killedBy: Goat It API Helpers createGoatItApiEndpoint should create the correct endpoint when undefined
statusReason: expected undefined to be '/question-themes' // Object.is equality

[Killed] MethodExpression
utils/goat-it-api/helpers/goat-it-api.helpers.ts:16:20
 };
 
 function createGoatItApiEndpoint(resourceName: GoatItApiResourceName, options?: CreateGoatItApiEndpointOptions): string {
-  const segments = [GOAT_IT_API_GAME_SCOPE_NAME, resourceName].filter(isNonEmptyString);
+  const segments = [GOAT_IT_API_GAME_SCOPE_NAME, resourceName];
   let endpoint = `/${segments.join("/")}`;
 
killedBy: Goat It API Helpers createGoatItApiEndpoint should create the correct endpoint when undefined
statusReason: expected '//question-themes' to be '/question-themes' // Object.is equality

[Killed] StringLiteral
utils/goat-it-api/helpers/goat-it-api.helpers.ts:17:36
 
 function createGoatItApiEndpoint(resourceName: GoatItApiResourceName, options?: CreateGoatItApiEndpointOptions): string {
   const segments = [GOAT_IT_API_GAME_SCOPE_NAME, resourceName].filter(isNonEmptyString);
-  let endpoint = `/${segments.join("/")}`;
+  let endpoint = `/${segments.join("")}`;
 
   if (isNonEmptyString(options?.id)) {
killedBy: Goat It API Helpers createGoatItApiEndpoint should use / separator when joining multiple endpoint segments.
statusReason: expected '/gamequestion-themes' to be '/game/question-themes' // Object.is equality

[Killed] ConditionalExpression
utils/goat-it-api/helpers/goat-it-api.helpers.ts:19:7
   const segments = [GOAT_IT_API_GAME_SCOPE_NAME, resourceName].filter(isNonEmptyString);
   let endpoint = `/${segments.join("/")}`;
 
-  if (isNonEmptyString(options?.id)) {
+  if (false) {
     endpoint += `/${options.id}`;
   } else if (isNonEmptyString(options?.suffix)) {
killedBy: Goat It API Helpers createGoatItApiEndpoint should create the correct endpoint when undefined
statusReason: expected '/question-themes' to be '/question-themes/abc123' // Object.is equality

[Killed] OptionalChaining
utils/goat-it-api/helpers/goat-it-api.helpers.ts:19:24
   const segments = [GOAT_IT_API_GAME_SCOPE_NAME, resourceName].filter(isNonEmptyString);
   let endpoint = `/${segments.join("/")}`;
 
-  if (isNonEmptyString(options?.id)) {
+  if (isNonEmptyString(options.id)) {
     endpoint += `/${options.id}`;
   } else if (isNonEmptyString(options?.suffix)) {
killedBy: Goat It API Helpers createGoatItApiEndpoint should create the correct endpoint when undefined
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] StringLiteral
utils/goat-it-api/helpers/goat-it-api.helpers.ts:20:17
   let endpoint = `/${segments.join("/")}`;
 
   if (isNonEmptyString(options?.id)) {
-    endpoint += `/${options.id}`;
+    endpoint += ``;
   } else if (isNonEmptyString(options?.suffix)) {
     endpoint += `/${options.suffix}`;
killedBy: Goat It API Helpers createGoatItApiEndpoint should create the correct endpoint when undefined
statusReason: expected '/question-themes' to be '/question-themes/abc123' // Object.is equality

[Killed] ConditionalExpression
utils/goat-it-api/helpers/goat-it-api.helpers.ts:21:14
 
   if (isNonEmptyString(options?.id)) {
     endpoint += `/${options.id}`;
-  } else if (isNonEmptyString(options?.suffix)) {
+  } else if (false) {
     endpoint += `/${options.suffix}`;
   }
killedBy: Goat It API Helpers createGoatItApiEndpoint should create the correct endpoint when undefined
statusReason: expected '/questions' to be '/questions/random' // Object.is equality

[Killed] OptionalChaining
utils/goat-it-api/helpers/goat-it-api.helpers.ts:21:31
 
   if (isNonEmptyString(options?.id)) {
     endpoint += `/${options.id}`;
-  } else if (isNonEmptyString(options?.suffix)) {
+  } else if (isNonEmptyString(options.suffix)) {
     endpoint += `/${options.suffix}`;
   }
killedBy: Goat It API Helpers createGoatItApiEndpoint should create the correct endpoint when undefined
statusReason: Cannot read properties of undefined (reading 'suffix')

[Killed] BlockStatement
utils/goat-it-api/helpers/goat-it-api.helpers.ts:27:126
   return endpoint;
 }
 
-function createGoatItApiFetchOptions(goatItApiRuntimeConfig: SharedRuntimeConfig["goatItApi"]): Parameters<typeof $fetch>[1] {
-  return {
-    baseURL: goatItApiRuntimeConfig.baseUrl,
-    headers: {
-      "goat-it-api-key": goatItApiRuntimeConfig.gameKey,
-    },
-  };
-}
+function createGoatItApiFetchOptions(goatItApiRuntimeConfig: SharedRuntimeConfig["goatItApi"]): Parameters<typeof $fetch>[1] {}
 
 function handleGoatItApiError(error: unknown): never {
killedBy: Goat It API Helpers createGoatItApiFetchOptions should create the correct fetch options for a given Goat It API runtime config when called.
statusReason: expected undefined to strictly equal { …(2) }

[Killed] ObjectLiteral
utils/goat-it-api/helpers/goat-it-api.helpers.ts:28:10
 }
 
 function createGoatItApiFetchOptions(goatItApiRuntimeConfig: SharedRuntimeConfig["goatItApi"]): Parameters<typeof $fetch>[1] {
-  return {
-    baseURL: goatItApiRuntimeConfig.baseUrl,
-    headers: {
-      "goat-it-api-key": goatItApiRuntimeConfig.gameKey,
-    },
-  };
+  return {};
 }
 
killedBy: Goat It API Helpers createGoatItApiFetchOptions should create the correct fetch options for a given Goat It API runtime config when called.
statusReason: expected {} to strictly equal { …(2) }

[Killed] BlockStatement
utils/goat-it-api/helpers/goat-it-api.helpers.ts:36:54
   };
 }
 
-function handleGoatItApiError(error: unknown): never {
-  if (!(error instanceof FetchError)) {
-    throw error;
-  }
-
-  const parsedError = API_RESPONSE_EXCEPTION_DTO.safeParse(error.data);
-
-  if (!parsedError.success) {
-    throw createError({
-      statusCode: HttpStatusCode.INTERNAL_SERVER_ERROR,
-      message: "Internal server error",
-    });
-  }
-
-  throw createError({
-    statusCode: parsedError.data.statusCode,
-    message: parsedError.data.message,
-    data: { errorCode: parsedError.data.errorCode },
-  });
-}
+function handleGoatItApiError(error: unknown): never {}
 
 export {
killedBy: Goat It API Helpers handleGoatItApiError when error is a FetchError with valid ApiResponseExceptionDto data should throw H3Error when called.
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
utils/goat-it-api/helpers/goat-it-api.helpers.ts:37:7
 }
 
 function handleGoatItApiError(error: unknown): never {
-  if (!(error instanceof FetchError)) {
+  if (false) {
     throw error;
   }
killedBy: Goat It API Helpers handleGoatItApiError should re-throw the original error when error is not a FetchError.
statusReason: expected a thrown error to be Error: Some other error

[Killed] BooleanLiteral
utils/goat-it-api/helpers/goat-it-api.helpers.ts:37:7
 }
 
 function handleGoatItApiError(error: unknown): never {
-  if (!(error instanceof FetchError)) {
+  if (error instanceof FetchError) {
     throw error;
   }
killedBy: Goat It API Helpers handleGoatItApiError when error is a FetchError with valid ApiResponseExceptionDto data should throw H3Error when called.
statusReason: expected error to be instance of H3Error

[Killed] ConditionalExpression
utils/goat-it-api/helpers/goat-it-api.helpers.ts:43:7
 
   const parsedError = API_RESPONSE_EXCEPTION_DTO.safeParse(error.data);
 
-  if (!parsedError.success) {
+  if (true) {
     throw createError({
       statusCode: HttpStatusCode.INTERNAL_SERVER_ERROR,
killedBy: Goat It API Helpers handleGoatItApiError when error is a FetchError with valid ApiResponseExceptionDto data should throw H3Error with status code from the parsed API error when called.
statusReason: expected 500 to be 409 // Object.is equality

[Killed] BlockStatement
utils/goat-it-api/helpers/goat-it-api.helpers.ts:43:29
 
   const parsedError = API_RESPONSE_EXCEPTION_DTO.safeParse(error.data);
 
-  if (!parsedError.success) {
-    throw createError({
-      statusCode: HttpStatusCode.INTERNAL_SERVER_ERROR,
-      message: "Internal server error",
-    });
-  }
+  if (!parsedError.success) {}
 
   throw createError({
killedBy: Goat It API Helpers handleGoatItApiError when error is a FetchError with invalid data that does not match ApiResponseExceptionDto should throw H3Error when called.
statusReason: expected error to be instance of H3Error

[Killed] StringLiteral
utils/goat-it-api/helpers/goat-it-api.helpers.ts:46:16
   if (!parsedError.success) {
     throw createError({
       statusCode: HttpStatusCode.INTERNAL_SERVER_ERROR,
-      message: "Internal server error",
+      message: "",
     });
   }
killedBy: Goat It API Helpers handleGoatItApiError when error is a FetchError with invalid data that does not match ApiResponseExceptionDto should throw H3Error with internal server error message when called.
statusReason: expected [Function] to throw error including 'Internal server error' but got ''

[Killed] ObjectLiteral
utils/goat-it-api/helpers/goat-it-api.helpers.ts:50:21
     });
   }
 
-  throw createError({
-    statusCode: parsedError.data.statusCode,
-    message: parsedError.data.message,
-    data: { errorCode: parsedError.data.errorCode },
-  });
+  throw createError({});
 }
 
killedBy: Goat It API Helpers handleGoatItApiError when error is a FetchError with valid ApiResponseExceptionDto data should throw H3Error with status code from the parsed API error when called.
statusReason: expected 500 to be 409 // Object.is equality

[Killed] ObjectLiteral
utils/goat-it-api/helpers/goat-it-api.helpers.ts:53:11
   throw createError({
     statusCode: parsedError.data.statusCode,
     message: parsedError.data.message,
-    data: { errorCode: parsedError.data.errorCode },
+    data: {},
   });
 }
killedBy: Goat It API Helpers handleGoatItApiError when error is a FetchError with valid ApiResponseExceptionDto data should throw H3Error with error code in data from the parsed API error when called.
statusReason: expected {} to strictly equal { Object (errorCode) }
