[Killed] BlockStatement
utils/helpers/string/string.helpers.ts:1:60
-function isNonEmptyString(input?: string): input is string {
-  return typeof input === "string" && input !== "";
-}
+function isNonEmptyString(input?: string): input is string {}
 
 export {
killedBy: Goat It API Helpers createGoatItApiEndpoint should create the correct endpoint when undefined
statusReason: expected '/' to be '/question-themes' // Object.is equality

[Killed] LogicalOperator
utils/helpers/string/string.helpers.ts:2:10
 function isNonEmptyString(input?: string): input is string {
-  return typeof input === "string" && input !== "";
+  return typeof input === "string" || input !== "";
 }
 
killedBy: Goat It API Helpers createGoatItApiEndpoint should create the correct endpoint when undefined
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
utils/helpers/string/string.helpers.ts:2:10
 function isNonEmptyString(input?: string): input is string {
-  return typeof input === "string" && input !== "";
+  return true;
 }
 
killedBy: Goat It API Helpers createGoatItApiEndpoint should create the correct endpoint when undefined
statusReason: Cannot read properties of undefined (reading 'id')
