[Killed] BlockStatement
utils/helpers/time/time.helpers.ts:1:49
-async function sleep(ms: number): Promise<void> {
-  return new Promise<void>(resolve => {
-    setTimeout(resolve, ms);
-  });
-}
+async function sleep(ms: number): Promise<void> {}
 
 export {
killedBy: sleep should call setTimeout with the specified delay when called.
statusReason: expected "setTimeout" to be called once with arguments: [ Any<Function>, 500 ]

Number of calls: 0

[Killed] BlockStatement
utils/helpers/time/time.helpers.ts:2:39
 async function sleep(ms: number): Promise<void> {
-  return new Promise<void>(resolve => {
-    setTimeout(resolve, ms);
-  });
+  return new Promise<void>(resolve => {});
 }
 
killedBy: sleep should call setTimeout with the specified delay when called.
statusReason: expected "setTimeout" to be called once with arguments: [ Any<Function>, 500 ]

Number of calls: 0
